app/controllers/credits_controller.rb

INSERT INTO "credits" ("amount_cents", "interest_cents", "refund_at", "created_at", "updated_at", "total_amount_cents") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount_cents", 10000], ["interest_cents", 1300], ["refund_at", Tue, 12 Sep 2017], ["created_at", 2017-08-30 16:43:03 UTC], ["updated_at", 2017-08-30 16:43:03 UTC], ["total_amount_cents", 11300]]
---
  def create
    @credit.save