app/controllers/loans_controller.rb

  def create
    @loan = Loan.new
    @loan.roi = set_roi
    @loan.capital = loan_params[:capital]
    @loan.save
---
INSERT INTO "loans" ("capital_cents", "created_at", "updated_at", "roi") VALUES ($1, $2, $3, $4) RETURNING "id"  [["capital_cents", 45500], ["created_at", 2017-08-30 17:18:22 UTC], ["updated_at", 2017-08-30 17:18:22 UTC], ["roi", 0.09]]